load-tests/scenarios/comprehensive-load-test.yml
config:
  target: 'http://api.ecommerce.local'
  phases:
    # Baseline
    - duration: 120
      arrivalRate: 50
      name: 'Warm-up'
    
    # Gradual ramp
    - duration: 300
      arrivalRate: 100
      rampTo: 500
      name: 'Ramp to normal load'
    
    # Normal load
    - duration: 600
      arrivalRate: 500
      name: 'Sustained normal load'
    
    # Peak load
    - duration: 300
      arrivalRate: 500
      rampTo: 2000
      name: 'Ramp to peak'
    
    # Sustained peak
    - duration: 600
      arrivalRate: 2000
      name: 'Sustained peak load'
    
    # Stress test
    - duration: 180
      arrivalRate: 2000
      rampTo: 5000
      name: 'Stress test'
    
    # Cool down
    - duration: 300
      arrivalRate: 5000
      rampTo: 50
      name: 'Cool down'

scenarios:
  - name: 'Browse Products'
    weight: 30
    flow:
      - get:
          url: '/api/products?page=1&limit=20'
      - think: 2
      - get:
          url: '/api/products/{{ $randomString() }}'
      - think: 3

  - name: 'Search'
    weight: 25
    flow:
      - get:
          url: '/api/products/search?q={{ $randomString() }}'
      - think: 2

  - name: 'Cart Operations'
    weight: 20
    flow:
      - post:
          url: '/api/cart/add'
          json:
            productId: '{{ $randomString() }}'
            quantity: '{{ $randomNumber(1, 5) }}'
      - get:
          url: '/api/cart'
      - think: 2

  - name: 'Checkout'
    weight: 15
    flow:
      - post:
          url: '/api/orders'
          json:
            items:
              - productId: '{{ $randomString() }}'
                quantity: 1
      - think: 5

  - name: 'User Profile'
    weight: 10
    flow:
      - get:
          url: '/api/users/profile'
      - think: 3

expect:
  maxErrorRate: 5
  p95: 500
  p99: 1000